<?php
use App\User;

 ?>
<!doctype html>
<html lang="ar" dir="rtl">
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />    <style>
        body { font-family: DejaVu Sans, sans-serif; }
        *{
            background-image: ;
        }
    </style>
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta name="description" content="">
    <meta name="author" content="">
</head>

<body direction="rtl" dir="rtl" style="direction: rtl" lang="ar">

<h2>اتفاقية تقديم عروض خصومات</h2>
<br>
<br>
<p>بعون الله وتوفيقه فإنه في يوم {{User::$day}}  بتاريخ: {{User::$date}} م بمدينة الرياض، تم الاتفاق والتراضي بين كل من:
    الطرف الأول: شركة أميال الذكية للتسويق الرقمي، سجل تجاري رقم (1010635552)
    ، بريد الكتروني <span  text-align:left ;>(Info@amyalsmart.com)</span>
    ، ومقرها: الرياض - برج المدار – تقاطع العليا العام وطريق خريص، جوال: (0583642827)
    ، ويمثلها الأستاذ: همام الحميضي ، بصفته: المدير العام.
    <br>
    الطرف الثاني: شركة {{User::$service_name}}،
    سجل تجاري رقم ({{User::$commercial_registration}})،
    بريد الكتروني<span  text-align:left ;>({{User::$email}})</span>،
    ومقرها الرياض،
    جوال: ({{User::$mobile_no}})،
    ويمثلها الأستاذ: ({{User::$name}}).</div>

<b>التمهيد:</b>
<p>
    حيث إن الطرف الأول يملك منصة أميال كنترول وتطبيق أميال اليت لعرض مزايا وخصومات الطرف الثاني لعملاء الطرف الاول، وحيث أن الطرف الثاني لديه منتجات عالية الجودة، ونظراً لرغبة الطرف الأول بعرض هذه المنتجات في منصة وتطبيق الطرف الأول، وحيث أن الطرف الثاني لديه الخبرة والقدرة والرغبة إلى تقديم منتجاته بعروض ومزايا للمستفيدين من منصة وتطبيق الطرف الأول، فقد تم الاتفاق والتراضي بين الطرفين وهما بكامل أهليتهما المعتبرة شرعاً ونظاماً على إبرام هذه الاتفاقية وفقا للشروط والبنود التالية:
</p>
<br>

<b>المادة الأولى: حجية التمهيد:</b>
<p>
    يعتبر التمهيد السابق الذكر، جزءاً لا يتجزأ من هذه الاتفاقية تُقرأ وتُفسر معها.
</p>
<br>

<b>المادة الثانية: سريان الاتفاقية ومدتها:</b>
<p>
    تسري هذه الاتفاقية لمدة (12) شهراً، وتبدأ من تاريخ {{$date}}م وحتى تاريخ {{$end_date}}م، وتتجدد تلقائياً ما لم يخطر أحد الطرفين الآخر بعدم رغبته بتجديد الاتفاقية قبل (30) يومًا من تاريخ انتهاء مدتها.</p>
<br>

<b>المادة الثالثة: موضوع الاتفاقية:</b>
<p>
    قيام الطرف الثاني بتقديم العروض والخصومات الواردة في المادة (الرابعة) للطرف الأول، من أجل إدراجها في منصة وتطبيق الطرف الأول، وذلك وفقاً للأحكام والالتزامات والشروط الواردة في هذه الاتفاقية.</p>
<br>

<b>المادة الرابعة: (العروض والخصومات):</b>
<p>
    يقدم الطرف الثاني مزايا وخصومات لكل عميل من عملاء الطرف الأول من خلال لوحة التحكم في اميال كنترول يتم تحديد نسبة الخصم وكود الخصم وأماكن الاستفادة من الخصم وبداية ونهاية الخصم واضافة أي شروط خاصة بالمزايا والخصومات.</p>
<br>

<b>المادة الخامسة: آلية تقديم العروض:</b>
<p>
    يلتزم الطرف الثاني بتقديم العروض لمستخدمي منصة وتطبيق الطرف الأول وفقاً لإحدى الطرق التالية:
    <br>
    أ. أن يقوم العميل بالطلب من الطرف الثاني عن طريق المسح على الباركود الموجود في منصة وتطبيق الطرف الأول.
    <br>
    ب. أن يقوم العميل بالطلب من الطرف الثاني عن طريق استخدام كود الخصم الموجود في منصة وتطبيق الطرف الأول.
    <br>
    ج. أن يقوم العميل بالطلب من الطرف الثاني ومن ثمّ يقدّم له ما يثبت انضمامه لمنصة وتطبيق الطرف الأول وأحقيته باستخدام العروض.</p>
<br>

<b>المادة السادسة: الالتزامات والمسؤوليات:</b>
<ol>
    <li>يلتزم الطرفان بالأنظمة والقوانين واللوائح المعمول بها في المملكة العربية السعودية.</li>
    <li>يلتزم الطرفان بالشروط والإجراءات والسياسات المتفق عليها، وبالمحافظة على سرية المعلومات المتبادلة بينهما.
    </li>
    <li>يلتزم الطرف الأول بتوفير رقم عضوية في المنصة والتطبيق للطرف الثاني، وفي حال تعددت فروع الطرف الثاني فيتم توفير رقم عضوية لكل فرع.
    </li>
    <li>يلتزم الطرف الأول بعد توقيع الاتفاقية بإرسال خطوات وطريقة تفعيل المنصة والتطبيق للطرف الثاني.
    </li>
    <li>يلتزم الطرف الثاني بجميع الاشتراطات والأنظمة واللوائح التي تضعها هيئة الزكاة والضريبة والجمارك، ويكون هو الطرف المسؤول مسؤولية كاملة عن أي مخالفات أو غرامات صادرة من هيئة الزكاة والضريبة والجمارك.
    </li>
    <li>يلتزم الطرف الثاني أنه مرخص ومسجل ومفوض بشكل نظامي لقيامه بتقديم جميع الخدمات الخاصة بهذه الاتفاقية، وبأنه المالك النظامي للمنتجات الخاصة بهذه الاتفاقية.
    </li>
    <li>يلتزم الطرف الثاني بتدريب العاملين لديه في منافذ البيع على استقبال حاملي المنصة والتطبيق، وإبلاغهم بالعروض المقدمة لمنسوبي منصة وتطبيق الطرف الأول والمذكورة في المادة (الخامسة) أعلاه.
    </li>
    <li>يلتزم الطرف الثاني بصحة جميع البيانات والصور والأسعار والعروض والأرقام الخاصة به على منصة وتطبيق الطرف الأول وفي حال إخلاله بذلك فيتحمل المسؤولية كاملة.
    </li>
</ol>
<br>

<b>المادة السابعة: أحكام عامة:
</b>
<ol>
    <li>اتفق الطرفان على أن الطرف الثاني يفوض الطرف الأول للتسويق والإعلان لمستخدمي منصة وتطبيق الطرف الأول في حدود موضوع هذه الاتفاقية.
    </li>
    <li>اتفق الطرفان على أن الطرف الأول يخلي مسؤوليته من كافة الأضرار والتعويضات الناتجة من عدم التزام الطرف الثاني بتقديم العروض والخصومات المذكورة في المادة (الرابعة)، ويكون الطرف الثاني هو المسؤول مسؤولية كاملة أمام المستفيدين من منصة وتطبيق الطرف الأول.
    </li>
    <li>اتفق الطرفان على أن هذه الاتفاقية تشمل الموقع والتطبيق (ان وجد) وخدمة العملاء التابعة للطرف الثاني.
    </li>
    <li>اتفق الطرفان على أنه يحق للطرف الأول في حدود بنود هذه الاتفاقية استخدام الشعارات والصور والأسماء والعلامات التجارية للطرف الثاني على موقع وتطبيق ومنصات الطرف الأول وفي حملاته التسويقية والترويجية.
    </li>
</ol>
<br>

<b>المادة الثامنة: انتهاء الاتفاقية:
</b>
<ol>
    <li>تنتهي هذه الاتفاقية بانتهاء المدة المتفق عليها وفقاً لما ورد في المادة (الثانية) أعلاه.
    </li>
    <li>في حال إخلال أي من الطرفين بأي بند من بنود هذه الاتفاقية، يقوم الطرف الآخر بإشعاره عبر إحدى وسائل التواصل المعتمدة بين الطرفين، وبعد مضي (15) يومًا من تاريخ الإشعار مع عدم قيام الطرف الآخر بتصحيح الوضع بشكل مرضي بما يتفق مع شروط وبنود الاتفاقية، فيحق للطرف الآخر إنهاء الاتفاقية.
    </li>
    <li>يحق لأي من الطرفين فسخ هذه الاتفاقية قبل مضي المدة المتفق عليها، وذلك بعد إشعار الطرف الآخر برغبته بالفسخ، على ألا تقل مدة الإشعار عن (60) يومًا، ويتم ذلك عبر إحدى وسائل التواصل المعتمدة بين الطرفين.
    </li>
</ol>
<br>

<b>المادة التاسعة التنازل عن الحقوق:
</b>
<p>
    إن تراخي أحد الطرفان في المطالبة بأي حق له مترتب على هذه الاتفاقية لا يمكن أن يفسر أو أن يفهم بأي حال من الاحوال على أنه تنازلاً منه عن ذلك الحق، ويحق له في أي وقت ممارسة هذا الحق والمطالبة به من جديد.
</p>
<br>

<b>المادة العاشرة: وسائل الإثبات:
</b>
<p>
    اتفق الطرفان أن تكون وسائل الإثبات المعتمدة في تنفيذ هذه الاتفاقية هي المراسلات الرسمية عن طريق الايميل او المراسلات من لوحة تحكم اميال كنترول.</p>
<br>

<b>المادة الحادي عشر: مرفقات الاتفاقية:
</b>
<p>
    مرفقات العقد: (المرفقات لابد وأن توقع مع العقد من قبل أطراف العقد):
    <br>
    أ. صورة السجل التجاري للطرفين. (تكون سارية المفعول).
    <br>
    ب. شهادة العنوان الوطني للطرفين.</p>
<br>

<b>المادة الثانية عشر: الإخطارات والإشعارات:
</b>
<p>
    يجب أن تكون جميع المراسلات أو الإخطارات أو الإنذارات فيما بين أطراف الاتفاقية مكتوبة ومرسلة على وسيلة التواصل المعتمدة في مقدمة الاتفاقية ويعد إرسالها على هذا النحو دليلا على استلامها من قبل الطرف الآخر ولا تقبل منازعته في ذلك.</p>
<br>

<b>المادة الثالثة عشر: المنازعات والخلافات:
</b>
<p>
    جميع المنازعات التي قد تنشأ ما بين الطرفين حول هذه الاتفاقية، أو تفسيرها، أو تنفيذها، فإنه يتم السعي لتسويتها عن طريق الصلح خلال (15) يومًا تحتسب من أول يوم يبلغ فيه أحد الأطراف الطرف الآخر عبر وسيلة التواصل المعتمدة برغبته بالتسوية، فإن انتهت المدة وتعذر الصلح فإنه يلجأ للمحكمة المختصة في مدينة الرياض.</p>
<br>

<b>المادة الرابعة عشر: نسخ الاتفاقية:</b>
<p>
    حرّرت هذ الاتفاقية من نسختين أصليتين وتسلم كل طرف نسخة منها، وتضمنت الاتفاقية خمسة عشر مادة، ويقر الطرفان بأنهما قد اطلعا على جميع بنود هذه الاتفاقية وبعد قراءتها وفهمها فهمًا نافيًا للجهالة والغبن والغرر، فقد وقعا وهما بكامل أهليتهما المعتبرة شرعًا ونظاماً.</p>
<br>

<h3>
    والله خير الشاهدين.
</h3>

<p>
    اتفق الطرفان انه بالموافقة على هذه الاتفاقية من خلال لوحة التحكم كافي لالتزام طرفي العقد بما ورد بالاتفاقية دون الحاجة الى اضافة توقيع خطي.
</p>
</body>
</html>
